## :x: Apply Result





<pre><code>Error: Error waiting to create Service: resource is in failed state &#34;Ready:False&#34;, message: Revision &#39;github-webhook-gateway-00001-jqr&#39; is not ready and cannot serve traffic. Image &#39;europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/github-webhook-gateway:v20230802-a960e47d&#39; not found.

  with module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway,
  on ../../modules/github-webhook-gateway/github-webhook-gateway.tf line 21, in resource &#34;google_cloud_run_service&#34; &#34;github_webhook_gateway&#34;:
  21: resource &#34;google_cloud_run_service&#34; &#34;github_webhook_gateway&#34; {
</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.google_client_config.gcp: Reading...
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Reading...
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
data.google_container_cluster.prow_k8s_cluster: Reading...
data.google_container_cluster.untrusted_workload_k8s_cluster: Reading...
google_service_account.sa_gke_kyma_integration: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com]
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
data.google_client_config.gcp: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
module.slack_message_sender.google_service_account.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
data.google_container_cluster.trusted_workload_k8s_cluster: Reading...
module.slack_message_sender.google_monitoring_alert_policy.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/17360148176148949136]
module.github_webhook_gateway.data.google_project.project: Reading...
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token]
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
data.google_container_cluster.prow_k8s_cluster: Read complete after 0s [id=projects/sap-kyma-prow/locations/europe-west3-a/clusters/prow]
google_container_cluster.trusted_workload: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
module.slack_message_sender.google_project_iam_member.project_run_invoker: Refreshing state... [id=sap-kyma-prow/roles/run.invoker/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.data.google_iam_policy.run_invoker: Reading...
module.slack_message_sender.google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/common-slack-bot-token/roles/secretmanager.secretAccessor/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.data.google_iam_policy.run_invoker: Read complete after 0s [id=1526577908]
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Read complete after 0s [id=855a9e69c8456439c97de0f50933e09215da23ba88f3d11f61e9195746970b7a]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
data.google_container_cluster.untrusted_workload_k8s_cluster: Read complete after 0s [id=projects/sap-kyma-prow/locations/europe-west3/clusters/untrusted-workload-kyma-prow]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=927f68fe2b1bee2bed9ddde896cce2ee56bbf0312119b6937b57278b94152090]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 0s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
data.google_container_cluster.trusted_workload_k8s_cluster: Read complete after 0s [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spsphostnamespace\n  annotations:\n    metadata.gatekeeper.sh/title: \"Host Namespace\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Disallows sharing of host PID and IPC namespaces by pod containers.\n      Corresponds to the `hostPID` and `hostIPC` fields in a PodSecurityPolicy.\n      For more information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#host-namespaces\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPHostNamespace\n      validation:\n        # Schema for the `parameters` field\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Disallows sharing of host PID and IPC namespaces by pod containers.\n            Corresponds to the `hostPID` and `hostIPC` fields in a PodSecurityPolicy.\n            For more information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#host-namespaces\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spsphostnamespace\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            input_share_hostnamespace(input.review.object)\n            msg := sprintf(\"Sharing the host namespace is not allowed: %v\", [input.review.object.metadata.name])\n        }\n\n        input_share_hostnamespace(o) {\n            o.spec.hostPID\n        }\n        input_share_hostnamespace(o) {\n            o.spec.hostIPC\n        }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spsphostnamespace]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspprivilegedcontainer\n  annotations:\n    metadata.gatekeeper.sh/title: \"Privileged Container\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls the ability of any container to enable privileged mode.\n      Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n      information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPPrivilegedContainer\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls the ability of any container to enable privileged mode.\n            Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n            information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspprivileged\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            c := input_containers[_]\n            not is_exempt(c)\n            c.securityContext.privileged\n            msg := sprintf(\"Privileged container is not allowed: %v, securityContext: %v\", [c.name, c.securityContext])\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spspprivilegedcontainer]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspallowprivilegeescalationcontainer\n  annotations:\n    metadata.gatekeeper.sh/title: \"Allow Privilege Escalation in Container\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls restricting escalation to root privileges. Corresponds to the\n      `allowPrivilegeEscalation` field in a PodSecurityPolicy. For more\n      information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privilege-escalation\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPAllowPrivilegeEscalationContainer\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls restricting escalation to root privileges. Corresponds to the\n            `allowPrivilegeEscalation` field in a PodSecurityPolicy. For more\n            information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privilege-escalation\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspallowprivilegeescalationcontainer\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            c := input_containers[_]\n            not is_exempt(c)\n            input_allow_privilege_escalation(c)\n            msg := sprintf(\"Privilege escalation container is not allowed: %v\", [c.name])\n        }\n\n        input_allow_privilege_escalation(c) {\n            not has_field(c, \"securityContext\")\n        }\n        input_allow_privilege_escalation(c) {\n            not c.securityContext.allowPrivilegeEscalation == false\n        }\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }\n        # has_field returns whether an object has a field\n        has_field(object, field) = true {\n            object[field]\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spspallowprivilegeescalationcontainer]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spsphostnetworkingports\n  annotations:\n    metadata.gatekeeper.sh/title: \"Host Networking Ports\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls usage of host network namespace by pod containers. Specific\n      ports must be specified. Corresponds to the `hostNetwork` and\n      `hostPorts` fields in a PodSecurityPolicy. For more information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#host-namespaces\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPHostNetworkingPorts\n      validation:\n        # Schema for the `parameters` field\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls usage of host network namespace by pod containers. Specific\n            ports must be specified. Corresponds to the `hostNetwork` and\n            `hostPorts` fields in a PodSecurityPolicy. For more information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#host-namespaces\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n            hostNetwork:\n              description: \"Determines if the policy allows the use of HostNetwork in the pod spec.\"\n              type: boolean\n            min:\n              description: \"The start of the allowed port range, inclusive.\"\n              type: integer\n            max:\n              description: \"The end of the allowed port range, inclusive.\"\n              type: integer\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spsphostnetworkingports\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            input_share_hostnetwork(input.review.object)\n            msg := sprintf(\"The specified hostNetwork and hostPort are not allowed, pod: %v. Allowed values: %v\", [input.review.object.metadata.name, input.parameters])\n        }\n\n        input_share_hostnetwork(o) {\n            not input.parameters.hostNetwork\n            o.spec.hostNetwork\n        }\n\n        input_share_hostnetwork(o) {\n            hostPort := input_containers[_].ports[_].hostPort\n            hostPort < input.parameters.min\n        }\n\n        input_share_hostnetwork(o) {\n            hostPort := input_containers[_].ports[_].hostPort\n            hostPort > input.parameters.max\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n            not is_exempt(c)\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n            not is_exempt(c)\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n            not is_exempt(c)\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spsphostnetworkingports]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["# k8sallowedimages constraint template validates that a pod is not using an image that is not allowed.\n# It prevents the use of images with the :latest tag.\n# The k8sallowedimages accepts one parameter:\n# - images: a list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\napiVersion: templates.gatekeeper.sh/v1beta1\nkind: ConstraintTemplate\nmetadata:\n  name: k8sallowedimages\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sAllowedImages\n      validation:\n        openAPIV3Schema:\n          properties:\n            images:\n              type: array\n              items:\n                type: string\n                description: A list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8sallowedimages\n        # Check containers are not using latest tag.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check if object is using an image with latest tag.\n          endswith(container.image, \":latest\")\n          msg := sprintf(\"container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed\", [container.name, input.review.object.metadata.namespace, container.image])\n        }\n\n        # Check init containers are not using latest tag.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check if object is using an image with latest tag.\n          endswith(container.image, \":latest\")\n          msg := sprintf(\"container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed\", [container.name, input.review.object.metadata.namespace, container.image])\n        }\n        # Check containers are using allowed images.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(container.image, input.parameters.images)\n          msg := sprintf(\"container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v\", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }\n\n        # Check init containers are using allowed images.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(container.image, input.parameters.images)\n          msg := sprintf(\"container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v\", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1beta1

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

google_cloud_run_service.github_webhook_gateway will be created
  + resource "google_cloud_run_service" "github_webhook_gateway" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "github-webhook-gateway"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/github-webhook-gateway:v20230802-a960e47d"
                  + name  = (known after apply)

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "github-webhook-gateway"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "github-webhook-gateway"
                    }
                  + env {
                      + name  = "LISTEN_PORT"
                      + value = "8080"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }
                  + env {
                      + name  = "PUBSUB_TOPIC"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "TOOLS_GITHUB_TOKEN_PATH"
                      + value = "/etc/gh-token/trusted_default_kyma-bot-github-sap-token"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }

                  + startup_probe {
                      + failure_threshold     = (known after apply)
                      + initial_delay_seconds = (known after apply)
                      + period_seconds        = (known after apply)
                      + timeout_seconds       = (known after apply)

                      + grpc {
                          + port    = (known after apply)
                          + service = (known after apply)
                        }

                      + http_get {
                          + path = (known after apply)
                          + port = (known after apply)

                          + http_headers {
                              + name  = (known after apply)
                              + value = (known after apply)
                            }
                        }

                      + tcp_socket {
                          + port = (known after apply)
                        }
                    }

                  + volume_mounts {
                      + mount_path = "/etc/gh-token"
                      + name       = "gh-tools-kyma-bot-token"
                    }
                }

              + volumes {
                  + name = "gh-tools-kyma-bot-token"

                  + secret {
                      + secret_name = "trusted_default_kyma-bot-github-sap-token"
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # module.github_webhook_gateway.google_pubsub_topic.issue_labeled will be created
  + resource "google_pubsub_topic" "issue_labeled" {
      + id      = (known after apply)
      + name    = "issue-labeled"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "gh_issue_finder_gh_tools_kyma_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "trusted_default_kyma-bot-github-sap-token"
    }

  # module.github_webhook_gateway.google_service_account.github_webhook_gateway will be created
  + resource "google_service_account" "github_webhook_gateway" {
      + account_id  = "github-webhook-gateway"
      + description = "Identity of cloud run instance running github webhook gateway service."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.secrets_leaks_log_scanner.data.google_iam_policy.run_invoker will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_iam_policy" "run_invoker" {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
            ]
          + role    = "roles/run.invoker"
        }
    }

  # module.secrets_leaks_log_scanner.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.secrets_leaks_log_scanner.data.google_secret_manager_secret.gh_tools_kyma_bot_token will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_secret_manager_secret" "gh_tools_kyma_bot_token" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + labels      = (known after apply)
      + name        = (known after apply)
      + replication = (known after apply)
      + rotation    = (known after apply)
      + secret_id   = "trusted_default_kyma-bot-github-sap-token"
      + topics      = (known after apply)
      + ttl         = (known after apply)
    }

  # module.secrets_leaks_log_scanner.data.google_storage_bucket.kyma_prow_logs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_storage_bucket" "kyma_prow_logs" {
      + autoclass                   = (known after apply)
      + cors                        = (known after apply)
      + custom_placement_config     = (known after apply)
      + default_event_based_hold    = (known after apply)
      + encryption                  = (known after apply)
      + force_destroy               = (known after apply)
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + lifecycle_rule              = (known after apply)
      + location                    = (known after apply)
      + logging                     = (known after apply)
      + name                        = "kyma-prow-logs"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + requester_pays              = (known after apply)
      + retention_policy            = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
      + versioning                  = (known after apply)
      + website                     = (known after apply)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.gcs_bucket_mover will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "gcs_bucket_mover" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/gcs-bucket-mover"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_creator will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "github_issue_creator" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/github-issue-creator"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_finder will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "github_issue_finder" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/github-issue-finder"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.secrets_leak_log_scanner will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "secrets_leak_log_scanner" {
        id          = "v1/projects/sap-kyma-prow/locations/europe-west3/services/secrets-leak-log-scanner"
      ~ policy_data = jsonencode(
            {
              - bindings = [
                  - {
                      - members = [
                          - "serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com",
                        ]
                      - role    = "roles/run.invoker"
                    },
                ]
            }
        ) -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer must be replaced
-/+ resource "google_project_iam_member" "project_log_writer" {
      ~ etag    = "BwYCZzZsCCw=" -> (known after apply)
      ~ id      = "projects/sap-kyma-prow/roles/logging.logWriter/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ project = "projects/sap-kyma-prow" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker must be replaced
-/+ resource "google_project_iam_member" "project_workflows_invoker" {
      ~ etag    = "BwYCZzZsCCw=" -> (known after apply)
      ~ id      = "projects/sap-kyma-prow/roles/workflows.invoker/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com" -> (known after apply)
      ~ project = "projects/sap-kyma-prow" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.slack_message_sender.google_cloud_run_service.slack_message_sender will be updated in-place
  ~ resource "google_cloud_run_service" "slack_message_sender" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender"
        name                       = "slack-message-sender"
        # (4 unchanged attributes hidden)

      ~ template {

          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  + env {
                      + name  = "KYMA_TEAM_SLACK_CHANNEL_ID"
                      + value = "C01LGCBS196"
                    }
                  + env {
                      + name  = "PROW_DEV_NULL_SLACK_CHANNEL_ID"
                      + value = "C01KSP10MB5"
                    }
                  + env {
                      + name  = "RELEASE_SLACK_CHANNEL_ID"
                      + value = "C01KKPXCPK8"
                    }
                  - env {
                      - name  = "SLACK_CHANNEL_ID" -> null
                      - value = "C01KSP10MB5" -> null
                    }
                  - env {
                      - name  = "SLACK_RELEASE_CHANNEL_ID" -> null
                      - value = "C01KKPXCPK8" -> null
                    }

                    # (9 unchanged blocks hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 6 to add, 5 to change, 2 to destroy.
module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer: Destroying... [id=projects/sap-kyma-prow/roles/logging.logWriter/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker: Destroying... [id=projects/sap-kyma-prow/roles/workflows.invoker/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_pubsub_topic.issue_labeled: Creating...
module.github_webhook_gateway.google_service_account.github_webhook_gateway: Creating...
module.github_webhook_gateway.google_service_account.github_webhook_gateway: Creation complete after 2s [id=projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor: Creating...
module.github_webhook_gateway.google_pubsub_topic.issue_labeled: Creation complete after 5s [id=projects/sap-kyma-prow/topics/issue-labeled]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor: Creation complete after 5s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway: Creating...
module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer: Destruction complete after 9s
module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker: Destruction complete after 9s
module.slack_message_sender.google_cloud_run_service.slack_message_sender: Modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender]
module.slack_message_sender.google_cloud_run_service.slack_message_sender: Still modifying... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender, 10s elapsed]
module.slack_message_sender.google_cloud_run_service.slack_message_sender: Modifications complete after 17s [id=locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender]
module.secrets_leaks_log_scanner.data.google_project.project: Reading...
module.secrets_leaks_log_scanner.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
module.secrets_leaks_log_scanner.data.google_storage_bucket.kyma_prow_logs: Reading...
module.secrets_leaks_log_scanner.data.google_iam_policy.run_invoker: Reading...
module.secrets_leaks_log_scanner.data.google_iam_policy.run_invoker: Read complete after 0s [id=735823064]
module.secrets_leaks_log_scanner.data.google_storage_bucket.kyma_prow_logs: Read complete after 0s [id=kyma-prow-logs]
module.secrets_leaks_log_scanner.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
module.secrets_leaks_log_scanner.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer: Creating...
module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker: Creating...
module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker: Creation complete after 9s [id=projects/sap-kyma-prow/roles/workflows.invoker/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]
module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer: Creation complete after 9s [id=projects/sap-kyma-prow/roles/logging.logWriter/serviceAccount:secrets-leak-detector@sap-kyma-prow.iam.gserviceaccount.com]

Error: Error waiting to create Service: resource is in failed state "Ready:False", message: Revision 'github-webhook-gateway-00001-jqr' is not ready and cannot serve traffic. Image 'europe-docker.pkg.dev/kyma-project/prod/test-infra/ko/github-webhook-gateway:v20230802-a960e47d' not found.

  with module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway,
  on ../../modules/github-webhook-gateway/github-webhook-gateway.tf line 21, in resource "google_cloud_run_service" "github_webhook_gateway":
  21: resource "google_cloud_run_service" "github_webhook_gateway" {


```

</details>

`

<!-- github-comment: {"Command":"apply","PRNumber":8564,"Program":"tfcmt","SHA1":"b281686e75b470b4aed98295ec3a24f1a6cd518f","Vars":{}} -->